# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 19  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv_BN_HSwish, [16, 2]],                              # 0-p1/2    320
   [-1, 1, MobileNetV3_InvertedResidual, [16,  24, 3, 2, 1, 0]],  # 1-p2/4    160 
   [-1, 1, MobileNetV3_InvertedResidual, [16, 24, 5, 1, 1, 1]],   # 2
   [-1, 3, CBAM, [16]],                                           
   [-1, 1, MobileNetV3_InvertedResidual, [24,  88, 3, 2, 0, 0]],  # 4-p3/8     80
   [-1, 1, MobileNetV3_InvertedResidual, [24,  88, 3, 1, 0, 0]],  
   [-1, 3, CBAM, [24]],
   [-1, 1, MobileNetV3_InvertedResidual, [40,  144, 5, 2, 1, 1]],  # 7-p4/16    40
   [-1, 1, MobileNetV3_InvertedResidual, [40, 144, 5, 1, 1, 1]],   
   [-1, 3, CBAM, [40]],                                           
   [-1, 1, MobileNetV3_InvertedResidual, [96, 576, 5, 2, 1, 1]],  # 10-p5/32    20
   [-1, 1, MobileNetV3_InvertedResidual, [96, 576, 5, 1, 1, 1]],  # 11
   [-1, 3, CBAM, [96]],  
   [-1, 1, SPPF, [96, 5]],                                        # 13
  ]
 

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [256, 1, 1]], # 14  
   [-1, 3, CBAM, [256]],            
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 9], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [256, False]],  # 18
 
   [-1, 1, Conv, [128, 1, 1]], # 19
   [-1, 3, CBAM, [128]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [128, False]],  # 23 (P3/8-small)
 
   [-1, 1, Conv, [128, 3, 2]],
   [-1, 3, CBAM, [128]],
   [[-1, 20], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [256, False]],  # 27 (P4/16-medium)
 
   [-1, 1, Conv, [256, 3, 2]],
   [-1, 3, CBAM, [256]],
   [[-1, 15], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [512, False]],  # 31 (P5/32-large)
 
   [[23, 27, 31], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]